Revit 2024 API
EnergyAnalysisDetailModelTier Enumeration
 Level of computation for energy analysis model.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Since: 2012
Syntax
C#
public enum EnergyAnalysisDetailModelTier
Visual Basic
Public Enumeration EnergyAnalysisDetailModelTier
Visual C++
public enum class EnergyAnalysisDetailModelTier
Members
Member name | Description
NotComputed |  Not computed.
FirstLevelBoundaries |  Spaces and zones, e.g. minimal need for display. This refers to the analytical spaces. The analytical spaces are produced from Rooms if you are using RAC, and from MEP Spaces if you are using RME.
SecondLevelBoundaries |  Analytical surfaces.
Final |  Constructions, schedules, non-graphical data.
See Also
Autodesk.Revit.DB.Analysis Namespace